###################################################################

# Created by write_sdc on Tue May 10 16:53:23 2022

###################################################################
set sdc_version 2.1

create_clock -period 8 [get_ports clk]
set_clock_latency 1 clk
set_clock_uncertainty -setup 0.5 [get_clocks clk]
set_clock_uncertainty -hold  0.1 [get_clocks clk]
set_clock_transition 0.3 [get_clocks clk]

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 2000
set_max_fanout 20 [current_design]
set_max_transition 2 [current_design]
set_load -pin_load 1 [get_ports {M[15]}]
set_load -pin_load 1 [get_ports {M[14]}]
set_load -pin_load 1 [get_ports {M[13]}]
set_load -pin_load 1 [get_ports {M[12]}]
set_load -pin_load 1 [get_ports {M[11]}]
set_load -pin_load 1 [get_ports {M[10]}]
set_load -pin_load 1 [get_ports {M[9]}]
set_load -pin_load 1 [get_ports {M[8]}]
set_load -pin_load 1 [get_ports {M[7]}]
set_load -pin_load 1 [get_ports {M[6]}]
set_load -pin_load 1 [get_ports {M[5]}]
set_load -pin_load 1 [get_ports {M[4]}]
set_load -pin_load 1 [get_ports {M[3]}]
set_load -pin_load 1 [get_ports {M[2]}]
set_load -pin_load 1 [get_ports {M[1]}]
set_load -pin_load 1 [get_ports {M[0]}]
set_load -pin_load 1 [get_ports done]
set_max_fanout 5 [get_ports {A[7]}]
set_max_fanout 5 [get_ports {A[6]}]
set_max_fanout 5 [get_ports {A[5]}]
set_max_fanout 5 [get_ports {A[4]}]
set_max_fanout 5 [get_ports {A[3]}]
set_max_fanout 5 [get_ports {A[2]}]
set_max_fanout 5 [get_ports {A[1]}]
set_max_fanout 5 [get_ports {A[0]}]
set_max_fanout 5 [get_ports {B[7]}]
set_max_fanout 5 [get_ports {B[6]}]
set_max_fanout 5 [get_ports {B[5]}]
set_max_fanout 5 [get_ports {B[4]}]
set_max_fanout 5 [get_ports {B[3]}]
set_max_fanout 5 [get_ports {B[2]}]
set_max_fanout 5 [get_ports {B[1]}]
set_max_fanout 5 [get_ports {B[0]}]
set_max_fanout 5 [get_ports clk]
set_max_fanout 5 [get_ports rst_n]
set_max_fanout 5 [get_ports start]
set_max_delay 0.5  -to [get_ports {M[15]}]
set_max_delay 0.5  -to [get_ports {M[14]}]
set_max_delay 0.5  -to [get_ports {M[13]}]
set_max_delay 0.5  -to [get_ports {M[12]}]
set_max_delay 0.5  -to [get_ports {M[11]}]
set_max_delay 0.5  -to [get_ports {M[10]}]
set_max_delay 0.5  -to [get_ports {M[9]}]
set_max_delay 0.5  -to [get_ports {M[8]}]
set_max_delay 0.5  -to [get_ports {M[7]}]
set_max_delay 0.5  -to [get_ports {M[6]}]
set_max_delay 0.5  -to [get_ports {M[5]}]
set_max_delay 0.5  -to [get_ports {M[4]}]
set_max_delay 0.5  -to [get_ports {M[3]}]
set_max_delay 0.5  -to [get_ports {M[2]}]
set_max_delay 0.5  -to [get_ports {M[1]}]
set_max_delay 0.5  -to [get_ports {M[0]}]
set_max_delay 0.5  -to [get_ports done]
set_drive 5  [get_ports {A[7]}]
set_drive 5  [get_ports {A[6]}]
set_drive 5  [get_ports {A[5]}]
set_drive 5  [get_ports {A[4]}]
set_drive 5  [get_ports {A[3]}]
set_drive 5  [get_ports {A[2]}]
set_drive 5  [get_ports {A[1]}]
set_drive 5  [get_ports {A[0]}]
set_drive 5  [get_ports {B[7]}]
set_drive 5  [get_ports {B[6]}]
set_drive 5  [get_ports {B[5]}]
set_drive 5  [get_ports {B[4]}]
set_drive 5  [get_ports {B[3]}]
set_drive 5  [get_ports {B[2]}]
set_drive 5  [get_ports {B[1]}]
set_drive 5  [get_ports {B[0]}]
set_drive 5  [get_ports clk]
set_drive 5  [get_ports rst_n]
set_drive 5  [get_ports start]
