###################################################################

# Created by write_sdc on Thu Jun  2 09:29:42 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_max_area 8000
set_max_fanout 20 [current_design]
set_max_transition 2 [current_design]
set_load -pin_load 1 [get_ports cycle]
set_load -pin_load 1 [get_ports write]
set_load -pin_load 1 [get_ports ifetch]
set_load -pin_load 1 [get_ports iack]
set_load -pin_load 1 [get_ports ie]
set_load -pin_load 1 [get_ports {address[15]}]
set_load -pin_load 1 [get_ports {address[14]}]
set_load -pin_load 1 [get_ports {address[13]}]
set_load -pin_load 1 [get_ports {address[12]}]
set_load -pin_load 1 [get_ports {address[11]}]
set_load -pin_load 1 [get_ports {address[10]}]
set_load -pin_load 1 [get_ports {address[9]}]
set_load -pin_load 1 [get_ports {address[8]}]
set_load -pin_load 1 [get_ports {address[7]}]
set_load -pin_load 1 [get_ports {address[6]}]
set_load -pin_load 1 [get_ports {address[5]}]
set_load -pin_load 1 [get_ports {address[4]}]
set_load -pin_load 1 [get_ports {address[3]}]
set_load -pin_load 1 [get_ports {address[2]}]
set_load -pin_load 1 [get_ports {address[1]}]
set_load -pin_load 1 [get_ports {address[0]}]
set_load -pin_load 1 [get_ports {data_out[7]}]
set_load -pin_load 1 [get_ports {data_out[6]}]
set_load -pin_load 1 [get_ports {data_out[5]}]
set_load -pin_load 1 [get_ports {data_out[4]}]
set_load -pin_load 1 [get_ports {data_out[3]}]
set_load -pin_load 1 [get_ports {data_out[2]}]
set_load -pin_load 1 [get_ports {data_out[1]}]
set_load -pin_load 1 [get_ports {data_out[0]}]
set_max_fanout 5 [get_ports clk]
set_max_fanout 5 [get_ports rst_n]
set_max_fanout 5 [get_ports nmi]
set_max_fanout 5 [get_ports int]
set_max_fanout 5 [get_ports ready]
set_max_fanout 5 [get_ports {data_in[7]}]
set_max_fanout 5 [get_ports {data_in[6]}]
set_max_fanout 5 [get_ports {data_in[5]}]
set_max_fanout 5 [get_ports {data_in[4]}]
set_max_fanout 5 [get_ports {data_in[3]}]
set_max_fanout 5 [get_ports {data_in[2]}]
set_max_fanout 5 [get_ports {data_in[1]}]
set_max_fanout 5 [get_ports {data_in[0]}]
set_max_fanout 5 [get_ports scan_in]
set_max_fanout 5 [get_ports scan_en]
set_max_fanout 5 [get_ports scan_mode]
create_clock [get_ports clk]  -period 20  -waveform {0 4}
set_clock_uncertainty -setup 0.4  [get_clocks clk]
set_max_delay 12  -to [get_ports cycle]
set_max_delay 12  -to [get_ports write]
set_max_delay 12  -to [get_ports ifetch]
set_max_delay 12  -to [get_ports iack]
set_max_delay 12  -to [get_ports ie]
set_max_delay 12  -to [get_ports {address[15]}]
set_max_delay 12  -to [get_ports {address[14]}]
set_max_delay 12  -to [get_ports {address[13]}]
set_max_delay 12  -to [get_ports {address[12]}]
set_max_delay 12  -to [get_ports {address[11]}]
set_max_delay 12  -to [get_ports {address[10]}]
set_max_delay 12  -to [get_ports {address[9]}]
set_max_delay 12  -to [get_ports {address[8]}]
set_max_delay 12  -to [get_ports {address[7]}]
set_max_delay 12  -to [get_ports {address[6]}]
set_max_delay 12  -to [get_ports {address[5]}]
set_max_delay 12  -to [get_ports {address[4]}]
set_max_delay 12  -to [get_ports {address[3]}]
set_max_delay 12  -to [get_ports {address[2]}]
set_max_delay 12  -to [get_ports {address[1]}]
set_max_delay 12  -to [get_ports {address[0]}]
set_max_delay 12  -to [get_ports {data_out[7]}]
set_max_delay 12  -to [get_ports {data_out[6]}]
set_max_delay 12  -to [get_ports {data_out[5]}]
set_max_delay 12  -to [get_ports {data_out[4]}]
set_max_delay 12  -to [get_ports {data_out[3]}]
set_max_delay 12  -to [get_ports {data_out[2]}]
set_max_delay 12  -to [get_ports {data_out[1]}]
set_max_delay 12  -to [get_ports {data_out[0]}]
set_drive 5  [get_ports clk]
set_drive 5  [get_ports rst_n]
set_drive 5  [get_ports nmi]
set_drive 5  [get_ports int]
set_drive 5  [get_ports ready]
set_drive 5  [get_ports {data_in[7]}]
set_drive 5  [get_ports {data_in[6]}]
set_drive 5  [get_ports {data_in[5]}]
set_drive 5  [get_ports {data_in[4]}]
set_drive 5  [get_ports {data_in[3]}]
set_drive 5  [get_ports {data_in[2]}]
set_drive 5  [get_ports {data_in[1]}]
set_drive 5  [get_ports {data_in[0]}]
set_drive 5  [get_ports scan_in]
set_drive 5  [get_ports scan_en]
set_drive 5  [get_ports scan_mode]
